dist/setup.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-10 火 16:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>WSL2 のセットアップ</title>
<meta name="author" content="Daisuke Arai" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="css/org-common.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">WSL2 のセットアップ</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org28da218">はじめに</a></li>
<li><a href="#org0950bf8">セットアップ</a></li>
</ul>
</div>
</div>

<div id="outline-container-org28da218" class="outline-2">
<h2 id="org28da218">はじめに</h2>
<div class="outline-text-2" id="text-org28da218">
<p>
WSL2 のセットアップを行います。セットアップを行うことで以下のアプリケーションのインストールと各種設定が行われます。
</p>

<ul class="org-ul">
<li>scoop</li>
<li>gsudo</li>
<li>Git</li>
<li>Windows Terminal</li>
<li>Microsoft-Windows-Subsystem-Linux</li>
<li>VirtualMachinePlatform</li>
<li>WSL2 カーネルアップデート</li>
<li>Ubuntu 20.04</li>
</ul>

<p>
Ubuntu には以下のアプリケーションをインストールします。
</p>

<ul class="org-ul">
<li>git</li>
<li>make</li>
</ul>
</div>
</div>

<div id="outline-container-org0950bf8" class="outline-2">
<h2 id="org0950bf8">セットアップ</h2>
<div class="outline-text-2" id="text-org0950bf8">
<ol class="org-ol">
<li>本ソースコードをダウンロードして展開します。</li>
<li><code>setup/setup.bat</code> をダブルクリックして実行します。</li>
<li>「Windows によって PC が保護されました」と表示されますので「詳細情報」をクリックします。</li>
<li>「実行」ボタンを押します。</li>
</ol>

<p>
セットアップ中はプログラムの表示する手順に従って進めて下さい。
途中再起動が必要な場合があります。再起動した場合はもう一度セットアップを実行してください。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-01-04</p>
<p class="author">Author: Daisuke Arai</p>
<p class="date">Created: 2023-01-10 火 16:32</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
